

Функция ПолучитьКурсыВалютНБРБ(ДатаКурсов)
    
    Если ДатаКурсов = Неопределено Тогда
        ДатаКурсов = ТекущаяДата();
    КонецЕсли;
    ДатаКурсов = НачалоДня(ДатаКурсов);
    
    СтрокаДаты = Формат(ДатаКурсов, "ДФ=yyyy-MM-dd");
    
    ИмяСервера = "api.nbrb.by";
    Порт = 443;
    Таймаут = 30;
    
    Путь = "/exrates/rates?ondate=" + СтрокаДаты + "&periodicity=0";
    
    Соединение = Новый HTTPСоединение(ИмяСервера, Порт, , , , Таймаут, Новый ЗащищенноеСоединениеOpenSSL());
    
    Запрос = Новый HTTPЗапрос(Путь);
    Запрос.Заголовки.Вставить("Accept", "application/json");
    
    Попытка
        Ответ = Соединение.Получить(Запрос);
    Исключение
        Сообщить("Ошибка соединения: " + ОписаниеОшибки());
        Возврат Неопределено;
    КонецПопытки;
    
    Если Ответ.КодСостояния <> 200 Тогда
        Сообщить("HTTP ошибка: " + Ответ.КодСостояния + " " + Ответ.ПолучитьТелоКакСтроку());
        Возврат Неопределено;
    КонецЕсли;
    
    СтрокаJSON = Ответ.ПолучитьТелоКакСтроку();
	
	
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Данные = Неопределено;   
	Данные = ПрочитатьJSON(ЧтениеJSON);
	

	// Сообщить("<<< ЗНАЧЕНИЕ ДАННЫХ: " + Строка(Данные) + " >>>");
	 
	 ЧтениеJSON.Закрыть();
    
    // Защита: если API вернул не массив — сразу выходим
	//Если ТипЗнч(Данные) <> Тип("Массив") Тогда
	//    Сообщить("API вернул не массив курсов. Тип: " + ТипЗнч(Данные));
	//    //Сообщить("Сырой JSON: " + СтрокаJSON);
	//    Возврат Неопределено;
	//КонецЕсли;
    
    Возврат Данные;  
    
КонецФункции
Процедура ЗагрузитьКурсыВРегистр(ДатаКурсов) Экспорт
    
    Данные = ПолучитьКурсыВалютНБРБ(ДатаКурсов);
    Если Данные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    МассивКурсов = Данные;      
    НаборЗаписей = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Период.Установить(ДатаКурсов);
    
    Для Каждого Элемент Из МассивКурсов Цикл
        
        Если ТипЗнч(Элемент) <> Тип("Структура") Тогда
            Продолжить;
        КонецЕсли;
        
        КодВалюты = Элемент["Cur_Abbreviation"];
        Курс = Элемент["Cur_OfficialRate"];
        
        Если КодВалюты = Неопределено Или Курс = Неопределено Тогда
            Продолжить;
        КонецЕсли;
        
        Валюта = Справочники.Валюты.НайтиПоКоду(КодВалюты);
        Если Валюта.Пустая() Тогда
            Продолжить; 
        КонецЕсли;
        
        НоваяЗапись = НаборЗаписей.Добавить();
        НоваяЗапись.Валюта = Валюта;
        НоваяЗапись.Период = ДатаКурсов;
        НоваяЗапись.Курс = Курс;
        
    КонецЦикла;
    
    НаборЗаписей.Записать();
    
КонецПроцедуры
