
Процедура ОбработкаПроведения(Отказ, Режим)
		// регистр ОсновныеНачисления
	Движения.ОсновныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаОсновныеНачисления Из ОсновныеНачисления Цикл
		Движение = Движения.ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачисления.ПериодДействияНачало;
		Движение.ПериодДействияКонец = ТекСтрокаОсновныеНачисления.ПериодДействияКонец;
		Движение.ПериодРегистрации = ПериодРасчета;
		Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник;
		Движение.ГрафикРаботы = ТекСтрокаОсновныеНачисления.ГрафикРаботы; 
		Движение.Размер = ТекСтрокаОсновныеНачисления.Размер ;
	КонецЦикла;
	
	// регистр ДополнительныеНачисления
	Движения.ДополнительныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаДополнительныеНачисления Из ДополнительныеНачисления Цикл
		Движение = Движения.ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаДополнительныеНачисления.ВидРасчета;
		Движение.ПериодРегистрации = ПериодРасчета; 
		
		Если ТекСтрокаДополнительныеНачисления.ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисления.Надбавка Тогда
			Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(ПериодРасчета,-1));
			Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(ПериодРасчета,-1));
		Иначе
			Движение.БазовыйПериодНачало = НачалоМесяца(ПериодРасчета);
			Движение.БазовыйПериодКонец = КонецМесяца(ПериодРасчета); 
		КонецЕсли;
		Движение.Сотрудник = ТекСтрокаДополнительныеНачисления.Сотрудник;  
		Движение.Размер = ТекСтрокаДополнительныеНачисления.Процент;
	КонецЦикла;
	
	
	Движения.Удержания.Записывать = Истина;
	Для Каждого ТекСтрокаУдержания Из Удержания Цикл
		Движение = Движения.Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.Удержания.ПодоходныйНалог;
		Движение.БазовыйПериодНачало = НачалоМесяца(ПериодРасчета);
		Движение.БазовыйПериодКонец = КонецМесяца(ПериодРасчета);
		Движение.ПериодРегистрации = ПериодРасчета;
		Движение.Сотрудник = ТекСтрокаУдержания.Сотрудник;
	КонецЦикла;
	
	Движения.Записать();
	
	//ОКЛАД
	Запрос = Новый Запрос;
	Запрос.Текст =    "ВЫБРАТЬ
	|	ОкладыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	СУММА(ОкладыСотрудниковСрезПоследних.Оклад) КАК Оклад
	|ПОМЕСТИТЬ ВТ_Оклады
	|ИЗ
	|	РегистрСведений.ОкладыСотрудников.СрезПоследних(&Дата, ) КАК ОкладыСотрудниковСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ОкладыСотрудниковСрезПоследних.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
	|	ОсновныеНачисленияДанныеГрафика.ДниПериодДействия КАК ДниПериодДействия,
	|	ОсновныеНачисленияДанныеГрафика.ДниФактическийПериодДействия КАК ДниФактическийПериодДействия,
	|	ЕСТЬNULL(ВТ_Оклады.Оклад, 0) КАК Оклад
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
	|			Регистратор = &Ссылка
	|				И ВидРасчета = &ВидРасчета) КАК ОсновныеНачисленияДанныеГрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Оклады КАК ВТ_Оклады
	|		ПО ОсновныеНачисленияДанныеГрафика.Сотрудник = ВТ_Оклады.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка"	, Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("Дата" , Дата);
	
	Результат =Запрос.Выполнить(); 
	Выборка = Результат.Выбрать();  
	
	Для Каждого  СтрокаТЧ из Движения.ОсновныеНачисления  Цикл 
		
		Если СтрокаТЧ.ВидРасчета <> ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда    
			Продолжить;
		КонецЕсли;	   
		
		Выборка.Сбросить();
		Выборка.НайтиСледующий(СтрокаТЧ.НомерСтроки, "НомерСтроки");
		
		СтрокаТЧ.Результат = Выборка.Оклад/Выборка.ДниПериодДействия * Выборка.ДниФактическийПериодДействия;
		
	КонецЦикла;
	
	
	//Командировка
	
	Запрос = Новый Запрос;
	Запрос.Текст =    "ВЫБРАТЬ
	|	ОкладыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	СУММА(ОкладыСотрудниковСрезПоследних.Оклад) КАК Оклад
	|ПОМЕСТИТЬ ВТ_Оклады
	|ИЗ
	|	РегистрСведений.ОкладыСотрудников.СрезПоследних(&Дата, ) КАК ОкладыСотрудниковСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ОкладыСотрудниковСрезПоследних.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
	|	ОсновныеНачисленияДанныеГрафика.ДниПериодДействия КАК ДниПериодДействия,
	|	ОсновныеНачисленияДанныеГрафика.ДниФактическийПериодДействия КАК ДниФактическийПериодДействия,
	|	ЕСТЬNULL(ВТ_Оклады.Оклад, 0) КАК Оклад
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
	|			Регистратор = &Ссылка
	|				И ВидРасчета = &ВидРасчета) КАК ОсновныеНачисленияДанныеГрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Оклады КАК ВТ_Оклады
	|		ПО ОсновныеНачисленияДанныеГрафика.Сотрудник = ВТ_Оклады.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка"	, Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ОсновныеНачисления.Комадировка);
	Запрос.УстановитьПараметр("Дата" , Дата);
	
	Результат =Запрос.Выполнить(); 
	Выборка = Результат.Выбрать();  
	
	Для Каждого  СтрокаТЧ из Движения.ОсновныеНачисления  Цикл 
		
		Если СтрокаТЧ.ВидРасчета <> ПланыВидовРасчета.ОсновныеНачисления.Комадировка Тогда    
			Продолжить;
		КонецЕсли;	   
		
		Выборка.Сбросить();
		Выборка.НайтиСледующий(СтрокаТЧ.НомерСтроки, "НомерСтроки");
		
		СтрокаТЧ.Результат = Выборка.Оклад/Выборка.ДниПериодДействия * Выборка.ДниФактическийПериодДействия * 1.25;
		
	КонецЦикла;
	
	
	//ОТПУСК
	
	Запрос = Новый Запрос;
	Запрос.Текст =    "ВЫБРАТЬ
	|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
	|	ОсновныеНачисленияДанныеГрафика.ДниПериодДействия КАК ДниПериодДействия,
	|	ОсновныеНачисленияДанныеГрафика.ДниФактическийПериодДействия КАК ДниФактическийПериодДействия,
	|	ОсновныеНачисленияДанныеГрафика.Размер КАК Размер
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
	|			Регистратор = &Ссылка
	|				И ВидРасчета = &ВидРасчета) КАК ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка"	, Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ОсновныеНачисления.Отпуск);
	
	Результат =Запрос.Выполнить(); 
	Выборка = Результат.Выбрать();  
	
	Для Каждого  СтрокаТЧ из Движения.ОсновныеНачисления  Цикл 
		
		Если СтрокаТЧ.ВидРасчета <> ПланыВидовРасчета.ОсновныеНачисления.Отпуск Тогда    
			Продолжить;
		КонецЕсли;	   
		
		Выборка.Сбросить();
		Выборка.НайтиСледующий(СтрокаТЧ.НомерСтроки, "НомерСтроки");
		
		СтрокаТЧ.Результат = Выборка.Размер/Выборка.ДниПериодДействия * Выборка.ДниФактическийПериодДействия;
		
	КонецЦикла;
	
	
	Движения.ОсновныеНачисления.Записать(,Истина);
	
	
	
	// Отпуск за свой счет 
	
	Запрос = Новый Запрос;
	Запрос.Текст =    "ВЫБРАТЬ
	|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
	|	ОсновныеНачисленияДанныеГрафика.ДниПериодДействия КАК ДниПериодДействия,     
	|	ОсновныеНачисленияДанныеГрафика.ДниФактическийПериодДействия КАК ДниФактическийПериодДействия,
	|	ОсновныеНачисленияДанныеГрафика.Размер КАК Размер
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
	|			Регистратор = &Ссылка
	|				И ВидРасчета = &ВидРасчета) КАК ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка"	, Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ОсновныеНачисления.ОтпускЗаСвойСчет);
	
	Результат =Запрос.Выполнить(); 
	Выборка = Результат.Выбрать();  
	
	Для Каждого  СтрокаТЧ из Движения.ОсновныеНачисления  Цикл 
		
		Если СтрокаТЧ.ВидРасчета <> ПланыВидовРасчета.ОсновныеНачисления.ОтпускЗаСвойСчет Тогда    
			Продолжить;
		КонецЕсли;	   
		
		Выборка.Сбросить();
		Выборка.НайтиСледующий(СтрокаТЧ.НомерСтроки, "НомерСтроки");
		
	КонецЦикла;
	Движения.ОсновныеНачисления.Записать(,Истина);
	
	
	
	//Больничный 
	
	Запрос = Новый Запрос;
	Запрос.Текст =     "ВЫБРАТЬ
	|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
	|	ОсновныеНачисленияДанныеГрафика.ДниПериодДействия КАК ДниПериодДействия,
	|	ОсновныеНачисленияДанныеГрафика.ДниФактическийПериодДействия КАК ДниФактическийПериодДействия,
	|	ОсновныеНачисленияДанныеГрафика.Размер КАК Размер
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
	|			Регистратор = &Ссылка
	|				И ВидРасчета = &ВидРасчета) КАК ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка"	, Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ОсновныеНачисления.Больничный);
	Запрос.УстановитьПараметр("Дата" , Дата);
	
	Результат =Запрос.Выполнить(); 
	Выборка = Результат.Выбрать();  
	
	Для Каждого  СтрокаТЧ из Движения.ОсновныеНачисления  Цикл 
		
		Если СтрокаТЧ.ВидРасчета <> ПланыВидовРасчета.ОсновныеНачисления.Больничный Тогда    
			Продолжить;
		КонецЕсли;	   
		
		Выборка.Сбросить();
		Выборка.НайтиСледующий(СтрокаТЧ.НомерСтроки, "НомерСтроки");
		
		СтрокаТЧ.Результат = Выборка.Размер * Выборка.ДниФактическийПериодДействия ;
		
	КонецЦикла;
	
	Движения.ОсновныеНачисления.Записать(,Истина);
	
	
	
	
	
	
	//Дополнительные начисления
	
	//Премия	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеНачисленияБазаОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ДополнительныеНачисленияБазаОсновныеНачисления.РезультатБаза КАК РезультатБаза
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисления.БазаОсновныеНачисления(
	|			&Измерение,
	|			&Измерение,
	|			,
	|			Регистратор = &Ссылка
	|				И ВидРасчета = &ВидРасчета) КАК ДополнительныеНачисленияБазаОсновныеНачисления";
	
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ДополнительныеНачисления.Премия);     
	
	Измерения= Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Измерение", Измерения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();  
	
	Для Каждого  СтрокаТЧ из Движения.ДополнительныеНачисления  Цикл 
		
		Если СтрокаТЧ.ВидРасчета <> ПланыВидовРасчета.ДополнительныеНачисления.Премия Тогда    
			Продолжить;
		КонецЕсли;	   
		
		ВыборкаДетальныеЗаписи.Сбросить();
		ВыборкаДетальныеЗаписи.НайтиСледующий(СтрокаТЧ.НомерСтроки, "НомерСтроки");
		
		СтрокаТЧ.Результат = ВыборкаДетальныеЗаписи.РезультатБаза * СтрокаТЧ.Размер / 100;
		
	КонецЦикла;
	
	
	//Дополнительные начисления
	
		//Надбавка	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеНачисленияБазаОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ДополнительныеНачисленияБазаОсновныеНачисления.РезультатБаза КАК РезультатБаза
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисления.БазаОсновныеНачисления(
	|			&Измерение,
	|			&Измерение,
	|			,
	|			Регистратор = &Ссылка
	|				И ВидРасчета = &ВидРасчета) КАК ДополнительныеНачисленияБазаОсновныеНачисления";
	
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ДополнительныеНачисления.Надбавка);     
	
	Измерения= Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Измерение", Измерения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();  
	
	Для Каждого  СтрокаТЧ из Движения.ДополнительныеНачисления  Цикл 
		
		Если СтрокаТЧ.ВидРасчета <> ПланыВидовРасчета.ДополнительныеНачисления.Надбавка Тогда    
			Продолжить;
		КонецЕсли;	   
		
		ВыборкаДетальныеЗаписи.Сбросить();
		Если ВыборкаДетальныеЗаписи.НайтиСледующий(СтрокаТЧ.НомерСтроки, "НомерСтроки") Тогда 
			
			СтрокаТЧ.Результат = ВыборкаДетальныеЗаписи.РезультатБаза * СтрокаТЧ.Размер/100;
		Иначе  
			СтрокаТЧ.Результат= 0;
		КонецЕсли;
	КонецЦикла;
	
	
	Движения.ДополнительныеНачисления.Записать(,Истина);
	
	//Удержания
		//Подоходный налог
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УдержанияБазаОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	|	УдержанияБазаОсновныеНачисления.РезультатБаза КАК РезультатБаза
	|ПОМЕСТИТЬ ВТ_База
	|ИЗ
	|	РегистрРасчета.Удержания.БазаОсновныеНачисления(
	|			&Измерение,
	|			&Измерение,
	|			,
	|			Регистратор = &Ссылка
	|				И ВидРасчета = &ВидРасчета) КАК УдержанияБазаОсновныеНачисления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УдержанияБазаДополнительныеНачисления.НомерСтроки,
	|	УдержанияБазаДополнительныеНачисления.РезультатБаза
	|ИЗ
	|	РегистрРасчета.Удержания.БазаДополнительныеНачисления(
	|			&Измерение,
	|			&Измерение,
	|			,
	|			Регистратор = &Ссылка
	|				И ВидРасчета = &ВидРасчета) КАК УдержанияБазаДополнительныеНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_База.НомерСтроки КАК НомерСтроки,
	|	СУММА(ВТ_База.РезультатБаза) КАК РезультатБаза
	|ИЗ
	|	ВТ_База КАК ВТ_База
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_База.НомерСтроки";
	
	
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.Удержания.ПодоходныйНалог);
	
	Измерения= Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Измерение", Измерения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();  
	
	Для Каждого  СтрокаТЧ из Движения.Удержания  Цикл 
		
		Если СтрокаТЧ.ВидРасчета <> ПланыВидовРасчета.Удержания.ПодоходныйНалог Тогда    
			Продолжить;
		КонецЕсли;	   
		
		ВыборкаДетальныеЗаписи.Сбросить();
		ВыборкаДетальныеЗаписи.НайтиСледующий(СтрокаТЧ.НомерСтроки, "НомерСтроки");
		
		СтрокаТЧ.Результат = ВыборкаДетальныеЗаписи.РезультатБаза * 13/100;
		
	КонецЦикла;
	
	Движения.Удержания.Записать(,Истина);
	
	
КонецПроцедуры
